web/app/Models/Menu/AdminMenu.php

SELECT *
FROM `co_adminMenu`
WHERE `isView` = 'y'
AND `co_adminMenu`.`delDt` IS NULL
ORDER BY `sort`
---
    public function __construct(bool $bool = false)
    {
        $model = new BaseModel('co_adminMenu');
        if( $bool === false ) $model->where('isView', 'y');
        $this->data = $model->orderBy('sort')->findAll();