web/app/Models/Menu/FrontMenu.php

SELECT *
FROM `co_frontMenu`
WHERE `isView` = 'y'
AND `co_frontMenu`.`delDt` IS NULL
ORDER BY `sort`
---
    public function __construct(bool $bool = false)
    {
        $this->nowUrl = explode( '/', uri_string(true) );
        $this->model = new BaseModel('co_frontMenu');
        if( $bool === false ) $this->model->where('isView', 'y');
        $this->data = $this->model->orderBy('sort')->findAll();