web/app/Helpers/url_helper.php

    function get_config_data( string $group = '', string $code = '') : array
	{
		$model = new BaseModel('co_config');
		$data = $model->where(['group'=>$group, 'code'=>$code])->first();
---
SELECT *
FROM `co_config`
WHERE `group` = 'manager'
AND `code` = 'memo'
AND `co_config`.`delDt` IS NULL
 LIMIT 1